<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Feature;

class FeatureSeeder extends Seeder
{
    public function run(): void
    {
        $features = [
            'پرداخت اقساطی با چک صیادی',
            'بیمه مسئولیت',
            'تامین امنیت جانی و مالی مشتری',
            'پارکینگ اختصاصی',
            'پارکینگ عمومی',
            'آبسردکن',
            'قهوه ساز',
            'چای ساز',
            'نوشیدنی های سرد',
            'کافی شاپ',
            'سرویس بهداشتی',
            'فضای انتظار',
            'اتاق تعویض لباس',
            'محفظه امن نگهداری وسائل',
            'شارژر موبایل',
            'اینترنت رایگان',
            'سیستم تهویه مطبوع',
            'سیستم صوتی',
            'مجله و کاتالوگ های روز',
            'تلویزیون',
            'صندلی ماساژور',
            'کتابخانه کوچک',
            'فضای رو باز',
            'نورپردازی هوشمندانه',
            'رزرواسیون آنلاین',
            'فضای اختصاصی کودکان',
            'فروش محصولات زیبایی و مراقبتی',
            'امکانات رفاهی برای همراهان مشتری',
        ];

        foreach ($features as $title) {
            Feature::create(['title' => $title]);
        }
    }
}
